{
  "beaches": [
    {
      "id": 1,
      "name": "Praia do Moledo",
      "img": "",
      "county": "Caminha",
      "district": "Viana do Castelo",
      "latitude": 41.85043260992245,
      "longitude": -8.866332833199627,
      "facingDirection": ["W"],
      "perfectWindDirectionSurf": ["E"],
      "description": "Moledo in North Portugal is an exposed beach break that has reasonably consistent surf and can work at any time of the year. The best wind direction is from the east. Most of the surf here comes from groundswells and the ideal swell direction is from the west. The beach break offers both left and right hand waves. Best around high tide. Rarely crowded here. Dangerous rips are a hazard of surfing here.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first Aid"]
    },
    {
      "id": 2,
      "name": "Praia da Alada",
      "img": "",
      "county": "Viana do Castelo",
      "district": "Viana do Castelo",
      "latitude": 41.77579596263613,
      "longitude": -8.871934071999847,
      "facingDirection": ["W"],
      "perfectWindDirectionSurf": ["E"],
      "description": "It's an Oceanic Beach in the northern hemisphere bathed by the Atlantic Ocean, located on the coast of Portugal - Iberian Peninsula - in the municipality of Viana do Castelo. Praia da Arda Beach, also known as Praia do Bico Beach, has a white sand that extends over 1,2 Km, making it one of Viana do Castelo county most beautiful sites. Going south one can find submerged rocky formations by the Ribeira do Bico1 or Ribeira da Fonte Arenosa2 mouth.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 3,
      "name": "Praia da Aguçadoura",
      "img": "",
      "county": "Póvoa de Varzim",
      "district": "Porto",
      "latitude": 41.43329057925949,
      "longitude": -8.783351701116338,
      "facingDirection": ["W"],
      "perfectWindDirectionSurf": ["E"],
      "description": "Aguçadoura Beach (Praia da Aguçadoura in Portuguese) is a very wide and extensive white sand beach of Póvoa de Varzim, Portugal. It is located in the parish of Aguçadoura. Aguçadoura is popular among Northern Portuguese and Northern Spanish surfers and the world's first commercial wave farm is located in front of Aguçadoura beach, at the Aguçadora Wave Park. The beach is notable for its sand dunes, a reminder of the beaches of the city before the urbanization and farming. The remaining dunes, that are still several, are protected by the city council and Municipal Director Plan (PDM) from further development.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 4,
      "name": "Praia de Espinho",
      "img": "",
      "county": "Espinho",
      "district": "Porto",
      "latitude": 41.01146132158348,
      "longitude": -8.646622386816667,
      "facingDirection": ["W"],
      "perfectWindDirectionSurf": ["E"],
      "description": "Espinho beach is a section of the 17km long beach that extends south from the Douro estuary. During the height of the season, the main central section of the beach can become busy, but due to its length there is always space to be found. The beach faces a westerly direction and is exposed to the powerful Atlantic Ocean, which makes the waves suitable for surfing, but the sea temperature is surprisingly cold, even at the height of the summer. The town of Espinho is the largest and best resort town of the area, with numerous hotels, restaurants and bars.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 5,
      "name": "Praia International",
      "img": "",
      "county": "Matosinhos",
      "district": "Porto",
      "latitude": 41.177116157524,
      "longitude": -8.692246622465857,
      "facingDirection": ["SW"],
      "perfectWindDirectionSurf": ["NE"],
      "description": "Matosinhos is Porto's main beach. A long stretch of fine sand backed by apartment blocks, an esplanade and any number of small cafes it is pleasant enough. In the summer there's always some sort of activity on the beach and the lifeguard service makes for safe bathing. The water quality has improved greatly over the years, although it still isn't up to Blue Flag standards. Given there is a large port and oil terminal at the northern end of the beach this isn't a huge surprise. Matosinhos is also Porto's most consistent surf spot. Unlike the beaches towards Foz there aren't rocks everywhere and the harbour wall at the northern end can provide shelter from the wind. The gently sloping sand here takes some of the power out of the surf making it a suitable spot for all levels of surfer. One major benefit of coming to the beach at Matosinhos is this area is renown for its great restaurants, particularly seafood.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 6,
      "name": "Praia da Barra",
      "img": "",
      "county": "Ílhavo",
      "district": "Aveiro",
      "latitude": 40.62949636506578,
      "longitude": -8.750486787269097,
      "facingDirection": ["W"],
      "perfectWindDirectionSurf": ["E"],
      "description": "Located by the pontoon that marks the beginning of the Port of Aveiro and the end of the estuary, Barra Beach is both spacious and has good conditions for a range of sports including surfing, bodyboarding, kite-surfing, sailing and sea fishing. Very popular among sunbathers, the area takes on a new life during the summer months with the entertainment continuing well into the night at the many bars and discos and during local festivals. Right by the beach is the imposing Aveiro Lighthouse, built over a century ago and, at 62 metres in height is the tallest in Portugal.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 7,
      "name": "Praia de Buarcos",
      "img": "",
      "county": "Figueira da Foz",
      "district": "Coimbra",
      "latitude": 40.16355865767512,
      "longitude": -8.877017948663662,
      "facingDirection": ["SW"],
      "perfectWindDirectionSurf": ["NE"],
      "description": "The Mondego Cape appears as a sweeping extension of the Serra da Boa Viagem mountains and serves to protect the large sandy expanse of Buarcos Beach from strong northerly winds thereby creating a calmer sea that has become popular for windsurfing. Previously a calm fishing town, nowadays tourism has become the main livelihood in Buarcos turning it into a lively town with its focal point on the Avenida Marginal coast road, where the town meets the sea.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 8,
      "name": "Praia do Cabedelo",
      "img": "",
      "county": "Figueira da Foz",
      "district": "Porto",
      "latitude": 40.140898159905554,
      "longitude": -8.862784669370635,
      "facingDirection": ["W"],
      "perfectWindDirectionSurf": ["E"],
      "description": "Lying to the south of the Lima river, Cabedelo Beach is the first choice for local inhabitants of nearby Viana do Castelo. Surrounded by dunes and a pine forest, which includes two campsites, this pretty half-moon shaped Beach is one of the most popular in the region. Among its many regulars are surfers, windsurfers and bodyboarders who not only find the perfect waves for their respective sports but also the nightlife that continues into the night at the various bars looking out onto the sand.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 9,
      "name": "Praia do Baleal Norte",
      "img": "",
      "county": "Peniche",
      "district": "Leiria",
      "latitude": 39.37389572616583,
      "longitude": -9.336485049433957,
      "facingDirection": ["N"],
      "perfectWindDirectionSurf": ["S"],
      "description": "The beach north of Baleal is called Praia do Baleal Norte. Here you have two surf spots: Prainha and Lagide. Prainha is a beach break on the south end of the beach while Lagide is a reef break located a bit more to the north (right in front of the Surf Castle). Lagide is an a-frame breaking over a reef with both lefts and rights. The left from the a-frame is usually longer and better than the right. Although quite fat and mellow with high tide, Lagide can be amazing with bigger waves and around mid tide. Low tide is often too shallow. There is also another righthander 300 meters to the north.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 10,
      "name": "Praia do Baleal Sul",
      "img": "",
      "county": "Peniche",
      "district": "Leiria",
      "latitude": 39.372248008823874,
      "longitude": -9.338077953210751,
      "facingDirection": ["NW"],
      "perfectWindDirectionSurf": ["SE"],
      "description": "The beach in between Baleal and Peniche is called Praia do Baleal Sul. On this 4-kilometer-long beach you find multiple peaks for all surf levels. The surf spots on the south side of the beach (so closest to the town of Peniche) are called Gambôa and Cerro. This part of the bay normally receives less swell and is the place to go for smaller fun waves. It’s also a good spot for beginners, but watch out for the rocks at Gambôa.       The middle of the bay is called Meio da Baia and this picks up most of the swell. This wave packs some power and with the right conditions it’s a quality wave with some barrels. The most northern part of the bay is called Cantinho da Baia. This is a consistent beach break with mostly mellower lefts and rights suitable for all levels. The waves normally get smaller once you come closer to the both ends of the bay. Ideal for beginners as well. Side-offshore with the prevailing summer winds, means potential surf all year round.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 11,
      "name": "Praia dos Supertubos",
      "img": "",
      "county": "Peniche",
      "district": "Leiria",
      "latitude": 39.345451312241515,
      "longitude": -9.363004493010749,
      "facingDirection": ["W", "SW"],
      "perfectWindDirectionSurf": ["E", "NE"],
      "description": "Supertubos on the south side of Peniche is together with Carcavelos the best beach break in Portugal. It’s a world-class spot offering tubes of a lifetime. Long and heavy barrels are guaranteed with bigger swell from the west / southwest. There is a fine line between a fast barrel and a close out, so you have to pick the right ones. It’s a beach break with both lefts and rights, but the lefts are usually better. On bigger days, it’s only for advanced surfers willing to compete with a tough crowd. On small days, it’s also suitable for less experienced surfers. There are multiple peaks along the beach, but the quality ones will be packed on the good days. When the swell is from the northern directions, the waves at Supertubos are smaller since the peninsula of Peniche blocks the incoming swell. And when the waves at Supertubos are too big it’s worth to check Molho Leste, the beach just north of Supertubos.",
      "services": ["restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 12,
      "name": "Praia da Areia Branca",
      "img": "",
      "county": "Lourinhã",
      "district": "Lisboa",
      "latitude": 39.26461668469392,
      "longitude": -9.33583201015383,
      "facingDirection": ["W"],
      "perfectWindDirectionSurf": ["E"],
      "description": "Areia Branca is a small beach town located 15 km south of Peniche. Here you’ll find a river mouth beach break with multiple peaks and also some reefs on the north side of the beach. A bit more to the south there are two other beach breaks called Praia do Areal Sul and Praia da Peralta. Since it’s close to the Peninsula of Peniche, Praia da Areia Branca is less exposed to the northwest swells and therefore it is a little bit less consistent than most of the beaches down south and the beaches on the north side of Peniche. But this also means less crowds and a nice vibe! Watch out for strong currents with bigger swells.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 13,
      "name": "Praia de Santa Cruz",
      "img": "",
      "county": "Torres Vedras",
      "district": "Lisboa",
      "latitude": 39.14007465863132,
      "longitude": -9.38450841466866,
      "facingDirection": ["W"],
      "perfectWindDirectionSurf": ["E"],
      "description": "Santa Cruz is a typical coastal town, busy with tourists in summer, empty in winter. The beach breaks surrounding Santa Cruz offer lots of potential on small to medium swells. The peaks closer to town can get crowded, but if you venture more north, the wave quality gets better and the crowds less. You can find both lefts and rights on the different peaks to the north. Just south of Praia de Santa Cruz is also another break called Praia das Amoeiras. Santa Cruz is an exposed beach break, so it picks up lots of swell but is also sensitive to wind. The best wind direction is from the east and the preferred swell direction is west/northwest. Santa Cruz normally works best with low to mid tide, but this can change depending on the sand banks.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 14,
      "name": "Ribeira d'Ilhas",
      "img": "",
      "county": "Mafra",
      "district": "Lisboa",
      "latitude": 38.988396542798355,
      "longitude": -9.419209172103361,
      "facingDirection": ["W", "NW"],
      "perfectWindDirectionSurf": ["NE", "E", "SE"],
      "description": "Ribeira d’Ilhas doesn’t really need introduction, as it is one of the most popular and famous waves in Portugal. This surf spot located 3 km north of Ericeira, on a beach with the same name, represents the best Portugal has to offer when it comes to surfing. It therefore also hosted many regional, national and international surf competitions. Ribeira d’Ilhas is very long and quite mellow righthand point break breaking over a combination of reef and cobblestones. Since it breaks into deeper water, it’s also accessible for less experienced surfers. And even beginners can have some lessons on the little reform break on the north side of the reef. The long peeling shoulders of Ribeira are the perfect canvas to draw beautiful lines and improve your surfing. But be careful, because with a bigger swell, the waves get heavy and the currents strong. As being an extremely consistent wave that is suitable for various levels of surfing, Ribeira d’Ilhas is crowded most of the time. However, on an average day, there are several peaks with plenty of waves to spread the crowds. The inside is shorter but steeper and can be a fun option when the main peak is too crowded. And the break in front of Pedra Preta (black rock) just north of the main peak is also a good alternative. You can also paddle towards Pontinha, which is basically a faster and shorter version of Ribeira.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 15,
      "name": "Foz do Lizandro",
      "img": "",
      "county": "Mafra",
      "district": "Lisboa",
      "latitude": 38.9544641230886,
      "longitude": -9.415589766641169,
      "facingDirection": "W",
      "perfectWindDirectionSurf": "E",
      "description": "Foz do Lizandro is a beach break that is formed by a river mouth. You will find multiple peaks along the beach, but usually there is a left on the south side of the beach and an a-frame with lefts and rights in the middle of the beach. The north side of the beach is rocky and here you find two reef breaks: Lage dos Tubos and Limipicos. Foz do Lizandro is very consistent. The left at the river mouth can be your best bet in Ericeira with southern wind since it’s sheltered by some cliffs. Occasionally the sand bars line up properly and then this wave turns into a classy affair with long and hollow lefts. The beach break at Foz do Lizandro is normally best from low to mid tide, but with bigger swells also higher tide can be good. The waves are most of the time fun and easy to surf when the waves are smaller. This combined with the sandy bottom make it a popular beach among surf schools, ideal for beginners. With bigger swell, the rips are strong and dangerous. The best swell direction is coming from the southwest or west and the best wind direction is east. There are great facilities on the beach: good car park, showers and some nice cafés.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 16,
      "name": "Praia Grande",
      "img": "",
      "county": "Sintra",
      "district": "Lisboa",
      "latitude": 38.81616016963217,
      "longitude": -9.476969002171217,
      "facingDirection": "W",
      "perfectWindDirectionSurf": "E",
      "description": "Praia Grande is one of the most consistent and renowned breaks in the Lisbon area. This is a very versatile beach break with multiple peaks that work with different tides. Since the beach is very exposed, it picks up lots of swell, but it’s also very sensitive to wind. It’s a powerful beach break and only accessible for less experienced surfers when the waves are small. When it’s on, you can have great tubes here. But be prepared to share the line-up with some of Portugal’s finest locals! If Praia Grande is too crowded, you can check the smaller bay just north of Praia Grande, called Praia Pequena.",
      "services": ["lifeguard", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 17,
      "name": "Carcavelos",
      "img": "",
      "county": "Cascais",
      "district": "Lisboa",
      "latitude": 38.67992640723547,
      "longitude": -9.336055604872712,
      "facingDirection": ["S", "SW"],
      "perfectWindDirectionSurf": ["N", "NE"],
      "description": "Praia de Carcavelos is a famous beach break located only 20 km west of Lisbon city center. It’s one of the best surf spots in Portugal and offers barreling, fast and powerful waves with bigger swells. On smaller days, it’s also perfect suitable for beginners and less experienced surfers. There are many peaks along the beach with both lefts and rights. The lefts are usually better and more frequent than the rights. It can be surfed at all tides, but less water is normally better. This 1.5-km-long beach provides all the necessary facilities for surfers; parking, restaurants, showers and surf schools. Since Carcavelos is so close to Lisbon, you can expect it to be crowded in and outside the water. If the waves at Carcavelos are too big for your surf level, its neighbour Praia da Torre can offer fun conditions. Please note that the best time to surf this stretch of coast is October to March. In the summer there are usually no waves!",
      "services": ["lifeguard", "equipment", "restaurants", "showers", "accessibility", "transportation" , "parking", "wc", "first aid"]
    },
    {
      "id": 18,
      "name": "Costa da Caparica",
      "img": "",
      "county": "Almada",
      "district": "Setúbal",
      "latitude": 38.64650689926717,
      "longitude": -9.24172015913395,
      "facingDirection": "W",
      "perfectWindDirectionSurf": "E",
      "description": "Costa da Caparica, just south of Lisbon is a surfer’s paradise. Here you find 30 kilometer of beach breaks for all surf levels. From low tide lefts at Cova do Vapor to smaller waves at Fonte da Telha, there are lots of beaches and breaks to choose from. Although the waves close to the center of the town (known as CDS) are normally the best due to the jetties giving it more defined peaks, this is also the most crowded area. You can easily find less crowded peaks if you are willing to explore the coastline and drive south. But since Costa da Caparica and Carcavelos are the two most famous surf beaches close to Lisbon, you always have to deal with other surfers in the water. Costa da Caparica can work all year round and at all tides. In terms of waves size, it fits right in between the west coast around Ericeira and the south coast around Estoril.",
      "services": ["lifeguard", "restaurants", "accessibility", "transportation" , "parking", "first aid"]
    },
    {
      "id": 19,
      "name": "Fonte da Telha",
      "img": "",
      "county": "Almada",
      "district": "Setúbal",
      "latitude": 38.5788878121876,
      "longitude": -9.198736084004409,
      "facingDirection": "W",
      "perfectWindDirectionSurf": "E",
      "description": "The beaches of Costa da Caparica seem to be one long stretch of golden sand running from the river Tejo almost to the rugged promontory of Cabo Espichel. However, the miniature train (Transpraia) which drops visitors off at various points along this sandy coast only goes so far. 21 stops, and 8 km in fact which will drop you off at Praia da Fonte da Telha - the end of the line. I have seen some guides giving the impression Fonte da Telha is still some sleepy fishing community with a few beach shacks - make no mistake the beach here is firmly on the tourist map and also very popular with locals from Almada and Lisbon. In the summer it is always busy and buzzing with activity.",
      "services": ["lifeguard", "equipment", "restaurants", "accessibility", "transportation" , "free parking", "first aid"]
    },
    {
      "id": 20,
      "name": "Praia de São Torpes",
      "img": "",
      "county": "Sines",
      "district": "Setúbal",
      "latitude": 37.923420136216535,
      "longitude": -8.80527783439041,
      "facingDirection": "",
      "perfectWindDirectionSurf": "",
      "description": "Located just on the outskirts of Sines, the Praia de São Torpes is a Blue Flag award winning beach. It is easy to understand why, or not, depending on which way you look. Looking south, the sandy beach stretches off into the Southwest Alentejo Natural Park with a backdrop of grassy dunes and the rolling waves of the Atlantic. However, turn the other way and you will struggle not to be a little overwhelmed by the twin towering chimneys of an enormous power plant. And beyond that is the industrial landscape of the petrol refineries and port. Besides somewhat spoiling the view and belching coal fumes into the air the thermoelectric plant does have one benefit. Heated water is pumped into the sea here which actually raises the sea temperature a degree or so at the northern end of the beach. This water is perfectly clean, as the beach has to meet stringent criteria on water quality to keep its Blue Flag status. As well as being good news for those fancying a paddle it is a popular spot with local anglers. The waves at Praia de São Torpes are reputedly some of the best on the Alentejo coast making it a popular surf spot attracting all levels of surfer. There are a couple of surf schools run from the beach here.",
      "services": ["lifeguard", "equipment", "restaurants", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 21,
      "name": "Praia do Malhão",
      "img": "",
      "county": "Odemira",
      "district": "Beja",
      "latitude": 37.78659783858011,
      "longitude": -8.801607959872893,
      "facingDirection": "W",
      "perfectWindDirectionSurf": "E",
      "description": "The Praia do Malhao is a stunning and expansive beach that is situated to the north of Vila Nova de Milfontes. The isolated beach is set amidst the Sudoeste Alentejano  national park and this has protected this beautiful coastline from development.  The Praia do Malhao beach has absolutely no development and this adds to the remote and natural allure of the region, which is the main attraction of the beach. To reach Praia do Malhao visitors need their own transport (car or bike) and as away from the common areas of Vila Nova there is always plenty of space even at the height of the tourist season. The ferocious Atlantic Ocean waves means that the beach is great for body boarding or surfing but there is nowhere close to hire equipment and currents can be very strong. ",
      "services": ["equipment", "transportation", "free parking", "wc"]
    },
    {
      "id": 22,
      "name": "Praia da Arrifana",
      "img": "",
      "county": "Aljezur",
      "district": "Faro",
      "latitude": 37.29457864234483,
      "longitude": -8.86447853491638,
      "facingDirection": ["W", "SW"],
      "perfectWindDirectionSurf": ["E", "NE"],
      "description": "This beach, where there is a small fishing hamlet, nestles in a pretty shell-shaped bay, which shelters it from the cold wind and waves from the north. Although narrow, the beach stretches for over 700 metres and is framed by imposing, craggy, black schist sea cliffs. If you look to the south, you will see a huge, dark, thin rock sticking up out of the sea. This is called the Pedra da Agulha (Needle Rock) and it has become an icon on the Costa Vicentina. At the northernmost tip of the beach, next to the little fishing harbour, there are good conditions for diving, and this is also a great beach for surfing and bodyboarding. The panoramic view from the Arrifana Fortress (currently in ruins), standing atop the cliff to the north, is breathtaking. At Ponta da Atalaia, famous for its barnacles, traces can still be seen of a Muslim Ribat, a convent-fortress of great archaeological value.  Support infrastructures include a restaurant, WC and recreational facilities – a surfing school – and there are lifeguards on duty in the summer holiday season. Orientation: west / south-west.",
      "services": ["lifeguard", "equipment", "restaurants", "accessibility", "free parking", "first aid"]
    },
    {
      "id": 23,
      "name": "Praia da Cordoama",
      "img": "",
      "county": "Vila do Bispo",
      "district": "Faro",
      "latitude": 37.11127196885822,
      "longitude": -8.937046162072772,
      "facingDirection": ["W", "NW"],
      "perfectWindDirectionSurf": ["E", "SE"],
      "description": "Praia da Cordoama is a beautiful beach on the west coast of the Algarve. It is a big beach and is surrounded by several impressive cliffs. The beach is part of the Costa Vicentina natural park and the landscape around the beach is absolutely stunning. Because of the big waves on the beach, Praia da Cordoama is a great place for surfing. If you like remote, rough and wild beaches, you have come to the right place. Discover why this beach is well worth visiting.",
      "services": ["lifeguard", "equipment", "restaurants", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 24,
      "name": "Praia do Amado",
      "img": "",
      "county": "Aljezur",
      "district": "Faro",
      "latitude": 37.168180313141164,
      "longitude": -8.903788515284138,
      "facingDirection": ["W", "NW"],
      "perfectWindDirectionSurf": ["E", "NE"],
      "description": "Amado is a large beach stretching along three valleys. The warm red and ochre hues of the cliffs dominate to the north; and to the south, the grey of the craggy schist rocks once again comes to the fore. Amado Beach is famed for its versatile, diversified waves that justify the constant presence of on-site surfing schools. It is a frequent venue for national and international competitions in the sport. Despite being a very popular beach, you can still find some peaceful spots if you walk along the sands for a bit. A network of walkways leads visitors to various parts of the beach and to viewpoints overlooking it. There is road access via the cliff to the north, allowing you to reach Bordeira Beach, passing by the place known as Pontal and the curious fishing harbour at Zimbreirinha, where the boats are moored on wooden platforms suspended on the cliff. Along the route, there are various stopping points from which you can admire the stunning scenery along this stretch of coast.",
      "services": ["lifeguard", "equipment", "restaurants", "showers", "accessibility", "free parking", "wc", "first aid"]
    },
    {
      "id": 25,
      "name": "Praia de São Pedro",
      "img": "",
      "county": "Cascais",
      "district": "Lisboa",
      "latitude": 38.69375035441898,
      "longitude": -9.369475835438797,
      "facingDirection": ["S", "SE"],
      "perfectWindDirectionSurf": ["N", "NW"],
      "description": "Bico is a mellow pointbreak in São Pedro do Estoril. It’s a long righthander that picks up most swell of all the breaks on this stretch of coast. Situated on the west side of the beach called Praia de São Pedro de Estoril, it is a fun wave that is a favourite amongst longboarders and less experienced surfers. With more swell and the right swell direction, this righthander can connect all the way to the inside with a section called ‘Esquerda da Rocha’ (the rock’s left). The shore break can be quite heavy with a rising tide, so take care with getting in and out of the water. There is also another surf break called Bafureira on the other side of the bay. Please note that the best time to surf this stretch of coast is October to March. In the summer there are usually no waves!",
      "services": ["lifeguard", "equipment", "restaurants", "accessibility", "transportation" , "parking", "wc", "first aid"]
    },
    {
      "id": 26,
      "name": "Praia da Cresmina",
      "img": "",
      "county": "Cascais",
      "district": "Lisboa",
      "latitude": 38.724878906132886,
      "longitude": -9.47628877121736,
      "facingDirection": ["W", "NW"],
      "perfectWindDirectionSurf": ["E", "SW"],
      "description": "Just south of Praia do Guincho, there is a smaller and less-known beach called Praia da Cresmina. This surf spot is a mixture of a beach and reef break with a left on the south end of the beach and other peaks on the north side. Cresmina works with similar conditions as Guincho. It is very exposed to all the elements of the Atlantic Ocean, but is a bit more sheltered from the wind. It’s worth checking, especially since it’s normally less crowded than its bigger brother.",
      "services": ["lifeguard", "equipment", "restaurants","showers", "accessibility", "transportation" , "parking", "first aid"]
    },
    {
      "id": 27,
      "name": "Praia Pequena",
      "img": "",
      "county": "Sintra",
      "district": "Lisboa",
      "latitude": 38.820912338825224,
      "longitude": -9.473841319709079,
      "facingDirection": ["W"],
      "perfectWindDirectionSurf": ["E"],
      "description": "Praia Pequena is located just north of its bigger brother Praia Grande. It’s a smaller beach with less peaks, but the surf is quite consistent and the vibe often better. It also provides more shelter from the northern winds, which means cleaner conditions during the summer months. It can work on all tides; the best tide depends on the sand banks. Around mid tide is usually your best bet. Park your car in front of the Nortada restaurant and follow the path to the north, down the cliffs.",
      "services": ["equipment", "restaurants", "showers", "free parking", "wc"]
    },
    {
      "id": 28,
      "name": "Praia da Adraga",
      "img": "",
      "county": "Sintra",
      "district": "Lisboa",
      "latitude": 38.8042597947997,
      "longitude": -9.484768271485594,
      "facingDirection": ["E"],
      "perfectWindDirectionSurf": ["W"],
      "description": "Praia da Adraga is located just south of the famous Praia Grande, right in the Parque Natural de Sintra. You are surrounded with natural beauty while surfing this spot. The waves are not world-class, but Praia da Adraga has a pretty consistent lefthander that is usually not so crowded. It’s also possible to surf an a-frame when the sand banks align properly. The waves are fun, but the views are better. Take care of the big rock formation in the middle of the bay!",
      "services": ["lifeguard", "restaurants", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 29,
      "name": "Praia das Maçãs",
      "img": "",
      "county": "Sintra",
      "district": "Lisboa",
      "latitude": 38.825068482566905,
      "longitude": -9.469987047512756,
      "facingDirection": ["W", "NW"],
      "perfectWindDirectionSurf": ["E", "SE"],
      "description": "Praia das Maçãs is a small and cozy beach town just around the corner from the well-known surf spot Praia Grande. Its narrow beach offers consistent surf, but the quality of the waves depends a lot on the sand banks. It’s a beach break with rocks on both sides and sand in the middle. The sand part is suitable for all levels. Since the bay is not so wide, this spot gets easily crowded in the summer. It’s a good option with smaller swells and little or no wind.",
      "services": ["lifeguard", "equipment", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 30,
      "name": "Praia da Cova do Vapor",
      "img": "",
      "county": "Almada",
      "district": "Setúbal",
      "latitude": 38.662864559147025,
      "longitude": -9.258129325460782,
      "facingDirection": ["W"],
      "perfectWindDirectionSurf": ["E"],
      "description": "It's an Oceanic Beach in the northern hemisphere bathed by the Atlantic Ocean, located on the coast of Portugal - Iberian Peninsula - in the municipality of Almada. Praia da Cova do Vapor Beach is located in the sea front of Cova do Vapor fishing village and belongs to the Rio Tejo1 mouth by the south side. It discloses a wide and long sand divided into two split areas by a long pier of nearly 450 meters long that integrates the river bar. The south area is known as Praia do Albatroz Beach and owns a dune system. Here , the beach is bounded by a smaller pontoon. About 3,3 Km off shore, the Torre de São Lourenço or Torre do Bugio1 as the keeper of the entrance to the Rio Tejo.",
      "services": ["lifeguard", "restaurants", "transportation" , "free parking", "first aid"]
    },
    {
      "id": 31,
      "name": "Praia da Baleia",
      "img": "",
      "county": "Mafra",
      "district": "Lisboa",
      "latitude": 38.95894172021705,
      "longitude": -9.415981638546855,
      "facingDirection": ["W", "SW"],
      "perfectWindDirectionSurf": ["E", "NE"],
      "description": "Praia do Sul, also called Praia da Baleia, is the name of the beach just south of Ericeira center. It has multiple peaks, but the middle one is often referred to as Praia do Sul. The other breaks are Furnas on the north side of the beach and Papucos on the south side, right next to the peer. This beach only has surfable waves with a little bit bigger swells. In the summer months it’s usually flat. Here you can find both left and rights breaking over sand, but take care of the big rocks in the water. Although not the best wave in town, this spot has some shelter from the prevailing north winds and can be fun when everything else is blown-out. Pay attention to the rocks close to the beach.",
      "services": ["lifeguard", "equipment", "restaurants","showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 32,
      "name": "Praia de São Julião",
      "img": "",
      "county": "Mafra",
      "district": "Lisboa",
      "latitude": 38.93348477858969,
      "longitude": -9.419654375478514,
      "facingDirection": ["W", "NW"],
      "perfectWindDirectionSurf": ["E", "SE"],
      "description": "Praia de São Julião is a reliable beach break located 5 km south of Ericeira. This long stretch of beach offers multiple peaks with both lefts and rights. It picks up a lot of swell, so even on the smallest days there is most likely something to surf. On the bigger days and with the right tide and swell direction, you can get nice barrels here. But as São Julião is easily maxed out and also wind sensitive, you need to know when to go to get the best out of it. Normally the best time to surf is below mid tide, but this can change easily when the sand banks move. On the smaller days São Julião is beginner friendly and then you’ll also find multiple surf schools here. On the bigger days, the rips are heavy and dangerous. The main peak at the parking might be crowded, but as you walk along the beach towards Praia da Vigia you can have waves for yourself. But watch out for the rocks if you surf more towards the middle or south side of the beach!",
      "services": ["lifeguard", "restaurants", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 33,
      "name": "Praia do Magoito",
      "img": "",
      "county": "Sintra",
      "district": "Lisboa",
      "latitude": 38.860254157324874,
      "longitude": -9.451043100609564,
      "facingDirection": ["E"],
      "perfectWindDirectionSurf": ["W"],
      "description": "Praia do Magoito, located in the municipality of Sintra, is a great option if you are looking for a consistent surf spot with less crowds. It’s particularly known for its long righthander on the north side of the bay that works best with a bigger northwest swell. With higher tide, the cliffs provide some shelter from the prevailing northern winds. Besides the righthander in front of the parking, there are multiple peaks along the beach with both left and rights that provide surf at all tides. Most of the bottom is flat reef covered with sand, but there are also some rock formations further south towards Praia da Aguda.",
      "services": ["lifeguard", "equipment", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 34,
      "name": "Praia do Castelejo",
      "img": "",
      "county": "Vila do Bispo",
      "district": "Faro",
      "latitude": 37.100132572697696,
      "longitude": -8.946282433165788,
      "facingDirection": ["W", "NW"],
      "perfectWindDirectionSurf": ["E", "SE"],
      "description": "The road to the beach is winding and follows a deep valley through which a torrential stream twists and turns until it reaches the beach, forming a small patch of damp grass. The verdant slopes are covered with Mediterranean scrub, dotted with stone pines. The cliffs here are tall and dark; Torre de Aspa (a former watchtower) on the cliff to the south stands over 150 m high. To the north, Pedra da Laje is a series of rocks that, offshore, form famous fishing grounds and, closer to the beach, afford the opportunity to observe intertidal marine life as well as offering calm rock pools for children to bathe in. Undulating dune fields cover the schist cliffs to the north. This is a busy beach in comparison to Barriga and Cordoama, and is a favourite with surfers and bodyboarders. Occasionally, it is covered over by pebbles, which make a cavernous sound as they are rolled around by the waves.",
      "services": ["lifeguard", "equipment", "restaurants", "showers", "accessibility", "transportation" , "free parking", "wc", "first aid"]
    },
    {
      "id": 35,
      "name": "Praia do Tonel",
      "img": "",
      "county": "Vila do Bispo",
      "district": "Lisboa",
      "latitude": 37.00618451789164,
      "longitude": -8.947839020271854,
      "facingDirection": ["W", "SW"],
      "perfectWindDirectionSurf": ["E", "NE"],
      "description": "Praia do Tonel sits alongside the jutting Ponta de Sagres on the very southwesterly tip of Portugal. This dramatic location is exposed to the full force of the Atlantic Ocean and as such is a popular spot with surfers. If there isn't a wave here then there probably isn't one anywhere. The beach at Tonel is a generous sweep of golden sand backed by steep cliffs that vary from soft, red sandstone to the hard, sheer rock of the headland. But this is the beginning of the Algarve's west coast and is a far cry from the resort beaches further east. Praia do Tonel has a wild rugged feel to it, as it should being located on what was once thought of as the edge of the World. In the summer the waves tend to be a little smaller and there is a lifeguard patrol on the beach. Whilst this definitely makes things safer Tonel still isn't ideal for families with young children. The sea can be quite unpredictable here and it is renown for having strong currents. Just offshore is a small islet known as the Lion rock - at a squint, from the right angle it does look a little like a lion! It is quite common to see anglers sat on top of the rock, even when the tide is in and the surf is up - it is something of a mystery how they get out there (and back!).",
      "services": ["lifeguard", "equipment", "restaurants", "transportation" , "free parking"]
    },
    {
      "id": 36,
      "name": "Praia da Mareta",
      "img": "",
      "county": "Vila do Bispo",
      "district": "",
      "latitude": 37.00553434653666,
      "longitude": -8.938780327088514,
      "facingDirection": ["S"],
      "perfectWindDirectionSurf": ["N"],
      "description": "Praia da Mareta is the closest beach to Sages town itself, and unsurprisingly, as such, tends to be one of the busiest beaches in the area. However, it isn't just convenience that makes Mareta such a popular beach; with a sweep of golden sand stretching for nearly 800 metres and rocky headlands providing shelter from the notorious Sagres winds this is a great choice. Set in a south-facing bay Mareta benefits from the sunshine all day whilst being much more sheltered from the waves than the neighbouring Atlantic coast beaches. For this reason the beach here is used for a variety of watersports from kayaking and windsurfing to diving. The sea here isn't always flat calm though and Praia da Mareta is not only a great spot to learn to surf but can be the only place sheltered enough to surf in the winter months. There is a choice of three restaurants along the beach here all offering the usual range of light snacks up to full, sit-down meals. Other facilities include a seasonal lifeguard service, toilets and relatively close parking. ",
      "services": ["lifeguard", "equipment", "restaurants", "accessibility", "transportation", "free parking", "first aid"]
    }
  ]
}
